Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་གང་དག་སེམས་དམྱལ་མི་བཟད་སྐྱེས། །ལུས་ལ་མེ་ལྕེ་ཀུན་དུ་རབ་ཏུ་འབར། །སྐྱབས་མེད་མྱ་ངན་བཅས་ཤིང་ཡོངས་འཁྱམ་པ། །མེ་རྣམས་དེ་དག་རབ་ཏུ་ཞི་བར་ཤོག །
en: “ ‘May the fires be extinguished For the beings born in the terrible hells, Where their bodies burn completely in fire, And they wander in anguish without a savior.

source: སེམས་དམྱལ་ཡི་དགས་མི་ཡི་འཇིག་རྟེན་ན། །སེམས་ཅན་སྡུག་བསྔལ་མི་བཟད་དྲག་པོ་གང་། །རྔ་བོ་ཆེ་ཡི་སྒྲ་སྐད་འདི་ཡིས་ནི། །དེ་དག་རྣམས་ཀྱི་སྡུག་བསྔལ་ཀུན་ཞི་ཤོག །
en: “ ‘May the sound of the great drum Bring an end to the sufferings of those beings Who are experiencing intense, unendurable suffering In the hells, among the pretas, and in the human world.

source: རྟེན་མེད་དཔུང་གཉེན་མེད་པ་དང་། །སྐྱབས་མེད་པར་ནི་གྱུར་པ་དག །དེ་རྣམས་ལ་ནི་སྐྱོབ་པ་དང་། །དཔུང་གཉེན་རྟེན་མཆོག་བདག་གྱུར་ཅིག །
en: “ ‘For those who have no support, No protection, and no refuge, May there be protection and support, And may there be the supreme refuge.

source: སངས་རྒྱས་རྐང་གཉིས་དམ་པ་དག །ཐུགས་བརྩེ་ཐུགས་རྗེ་ལྡན་པའི་ཐུགས། །གང་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན། །བཞུགས་པ་བདག་ལ་དགོངས་སུ་གསོལ། །
en: “ ‘The buddhas, the supreme among two-legged beings, Who have minds of love and compassion, Who are in the worlds in the ten directions, I pray that you turn your regard upon me.

source: བདག་གིས་སྔོན་ཆད་སྡིག་པའི་ལས། །ཤིན་ཏུ་མི་བཟད་གང་བགྱིས་པ། །སྟོབས་བཅུའི་སྤྱན་སྔར་བདག་མཆིས་ཏེ། །དེ་དག་ཐམས་ཅད་བཤགས་པར་བགྱི། །ཕ་མ་དག་ཏུ་མི་འཛིན་དང་། །སངས་རྒྱས་རྣམས་སུ་མི་འཛིན་དང་། །དགེ་བ་དག་ཏུ་མི་འཛིན་པས། །སྡིག་པ་བདག་གིས་གང་བགྱིས་དང་། །ཕྱུག་ཅིང་རྒྱགས་པས་དྲེགས་པ་དང་། །རིགས་དང་ལོངས་སྤྱོད་རྒྱགས་པ་དང་། །གཞོན་པའི་རྒྱགས་པས་དྲེགས་པ་ཡིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །ཉེས་བསམས་ཉེས་པར་སྨྲས་པ་དང་། །ཉེས་པར་བགྱིས་པའི་ལས་རྣམས་དང་། །ཉེས་པའི་དམིགས་སུ་མ་བལྟས་པས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །བྱིས་པའི་བློ་ཡིས་འཇུག་པ་དང་། །མི་ཤེས་མུན་པའི་སེམས་དང་ནི། །སྡིག་པའི་གྲོགས་པོའི་དབང་གྱུར་དང་། །ཉོན་མོངས་རྣམ་པར་འཁྲུག་སེམས་དང་། །རྩེད་མོ་དགའ་བའི་དབང་ཉིད་དང་། །མྱ་ངན་དང་ནི་ནད་དབང་དང་། །ནོར་གྱི་མི་ཆོག་ཉེས་པ་ཡིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །འཕགས་མིན་སྐྱེ་བོ་འདྲེ་བ་དང་། །ཕྲག་དོག་སེར་སྣའི་རྒྱུ་དང་ནི། །གཡོ་དང་དབུལ་བའི་ཉེས་པ་ཡིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །ཕོངས་པ་འབྱུང་བའི་དུས་ཀྱི་ཚེ། །འདོད་པ་རྣམས་ཀྱི་འཇིགས་རྒྱུ་དང་། །ཕྱུག་པོ་མ་ཡིན་གྱུར་པ་ཡིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །གཡོ་བའི་སེམས་ཀྱི་དབང་ཉིད་དང་། །
en: “ ‘The extremely dreadful bad actions That I have carried out in the past, I confess all of them in the presence Of those who have the ten strengths.

source: འདོད་དང་ཁྲོ་བའི་དབང་དག་དང་། །བཀྲེས་དང་སྐོམ་གྱིས་ཉེན་པ་ཡིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །བཟའ་བ་དག་དང་བཏུང་བ་དང་། །བུད་མེད་སྒྱུ་དང་གོས་ཀྱི་ཕྱིར། །ཉོན་མོངས་གདུང་བ་སྣ་ཚོགས་ཀྱིས། །བདག་གིས་སྡིག་པ་གང་བགྱིས་དང་། །ལུས་དང་ངག་དང་ཡིད་ཀྱིས་སྡིག །ཉེས་པར་སྤྱད་པ་རྣམ་གསུམ་བསགས། །
en: “ ‘Whatever bad actions I have done, Such as ignoring my mother and father, Not acknowledging the buddhas, And not acknowledging good actions; “ ‘Whatever bad actions I have done, Such as being arrogant with pride in my wealth, Andr arrogant with pride in my family, My possessions, or my youth; “ ‘Whatever bad thoughts, bad words, And harmful actions I have produced; Whatever bad actions I have done, Not viewing them as being harmful; “ ‘Whatever bad actions I have done Through foolishness of mind, My mind being darkened by ignorance, Or being under the influence of bad friends, “ ‘Or through my mind being disturbed by kleśas, Because of delighting in amusements, Or through being in misery, being ill, Or through the evil of dissatisfaction with wealth; “ ‘Whatever bad actions I have done Because of associating with ignoble beings, Or caused by my jealousy and miserliness, Or by my dishonesty and neediness; “ ‘Whatever bad actions I have done During the times when I was in misfortune, Or through fears concerning my desires, Or when I was parted from my wealth; “ ‘Whatever bad actions I have done Under the power of a deceitful mind, Under the power of desire and anger, Or because of hunger and thirst; “ ‘Whatever bad actions I have done For the sake of food and drink, For the sake of women and clothes, Or from being tormented by various kleśas— “ ‘The bad actions of body, speech, and mind, My accumulation of those three kinds of bad conduct, Whatever I have done of that kind, I make a confession of it all.

source: འདི་འདྲའི་ཚུལ་གྱིས་གང་བགྱིས་པ། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །སངས་རྒྱས་རྣམས་དང་ཆོས་རྣམས་དང་། །དེ་བཞིན་ཉན་ཐོས་རྣམས་ལ་ཡང་། །གུས་པ་མ་ལགས་གང་བགྱིས་པ། །
en: “ ‘I make a confession of all Disrespect I have shown To the buddhas, the Dharma, And likewise to the śrāvakas.

source: དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །གང་ཡང་རང་སངས་རྒྱས་རྣམས་དང་། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཡང་། །གུས་པ་མ་ལགས་བགྱིས་པ་རྣམས། །
en: “ ‘I make a confession of all Disrespect I have shown To pratyekabuddhas And to bodhisattvas.

source: དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །དམ་ཆོས་སྨྲ་བ་རྣམས་ལ་ཡང་། །གུས་པ་མ་ལགས་བགྱིས་པ་དང་། །ཆོས་ལའང་གུས་པར་མ་བགྱིས་པ། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘I make a confession of all Disrespect I have shown To teachers of the Dharma and Disrespect I have shown to the Dharma itself.

source: བདག་གིས་རྟག་ཏུ་མི་ཤེས་པས། །དམ་པའི་ཆོས་ནི་སྤངས་པ་དང་། །ཕ་མ་རྣམས་ལ་མ་གུས་པ། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘I make a confession of all My rejection of the Dharma, And disrespect to my parents, Through being in constant ignorance.

source: བླུན་པ་དང་ནི་བྱིས་པ་དང་། །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་དང་། །ང་རྒྱལ་དྲེགས་པས་བསྒྲིབས་བགྱིས་པ། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘I make a confession of all Obscuration through stupidity and foolishness; Through desire, anger, and ignorance; And through pride and arrogance.

source: བདག་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་དུ། །སྟོབས་བཅུ་རྣམས་ལ་མཆོད་པར་ཤོག །
en: “ ‘May I make offerings to those with the ten strengths In the worlds in the ten directions.

source: བདག་ནི་ཕྱོགས་བཅུར་འཇིག་རྟེན་རྣམས། །སྡུག་བསྔལ་ཀུན་ལས་འདོན་གྱུར་ཅིག །
en: I will save from all suffering Those worlds in the ten directions.

source: སེམས་ཅན་བསམ་གྱིས་མི་ཁྱབ་ཀུན། །ས་བཅུ་དག་ལ་འགོད་པར་ཤོག །
en: “ ‘May I bring all the Countless beings onto the ten bhūmis.

source: ས་བཅུ་དག་ལ་གནས་ནས་ཀྱང་། །ཐམས་ཅད་དེ་བཞིན་གཤེགས་གྱུར་ཅིག །
en: When they have reached the ten bhūmis May they all become tathāgatas.

source: ཇི་སྲིད་སྡུག་བསྔལ་རྒྱ་མཚོ་ལས། །དེ་ཀུན་ཐར་བགྱིད་ནུས་སྲིད་དུ། །སེམས་ཅན་རེ་རེའི་ཕྱིར་ཡང་ནི། །བསྐལ་པ་བྱེ་བར་སྤྱོད་པར་ཤོག །
en: “ ‘Until I can free them all From the ocean of suffering, For millions of eons may I be active For the sake of every single being.

source: གསེར་འོད་དམ་པ་ཞེས་བགྱི་བ། །ལས་རྣམས་ཐམས་ཅད་བྱང་བྱེད་པ། །ཟབ་མོ་དག་ནི་སྟོན་པ་འདི། །སེམས་ཅན་དེ་དག་སྟོན་གྱུར་ཅིག །
en: “ ‘May I teach those beings This profound teaching That is called The Sublime Golden Light And purifies one of all karma.

source: གང་གིས་བསྐལ་པ་སྟོང་རྣམས་སུ། །སྡིག་པ་ཤིན་ཏུ་མི་བཟད་བགྱིས། །ལན་ཅིག་རབ་ཏུ་བཤགས་པ་ཡིས། །དེ་དག་ཐམས་ཅད་བྱང་བར་འགྱུར། །
en: “ ‘Those who have committed dreadful evil acts Throughout a thousand eons Will purify themselves of them Through one single confession.

source: གང་གིས་ལས་ཀྱི་སྒྲིབ་པ་རྣམས། །མྱུར་དུ་ཡང་དག་ཟད་འགྱུར་བ། །གསེར་འོད་དམ་པ་དགེ་བ་ཡིས། །བཤགས་པས་འདི་དག་བཤགས་ནས་ནི། །
en: “ ‘Those who are obscured by bad karma Will quickly become purified of it Through confessing with these confessions Through the good Sublime Golden Light.

source: རིན་ཆེན་འབྱུང་གནས་མཆོག་བཅུ་པོ། །ས་བཅུ་ལ་ནི་གནས་པར་ཤོག །
en: “ ‘May I dwell upon the ten bhūmis, The supreme ten that are the source of jewels.

source: སངས་རྒྱས་ཡོན་ཏན་སྣང་གྱུར་ཅིག །སྲིད་པའི་མཚོ་ལས་སྒྲོལ་བར་ཤོག །སངས་རྒྱས་རྒྱ་མཚོ་ཆུ་བོ་དང་། །
en: May the qualities of a buddha appear And may I liberate others from the ocean of existence.

source: ཡོན་ཏན་རྒྱ་མཚོ་ཟབ་མོ་དེ། །སངས་རྒྱས་ཡོན་ཏན་བསམ་ཡས་ཀྱིས། །ཐམས་ཅད་མཁྱེན་དུ་རྫོགས་པར་ཤོག །
en: “ ‘Through the inconceivable qualities of a buddha, The flow of the ocean of buddhahood, And the deep ocean of buddha qualities, May I have the perfection of omniscience.

source: ཏིང་འཛིན་བརྒྱ་ཕྲག་སྟོང་རྣམས་དང་། །གཟུངས་རྣམས་བསམ་གྱིས་མི་ཁྱབ་དང་། །དབང་སྟོབས་བྱང་ཆུབ་ཡན་ལག་གིས། །སྟོབས་བཅུ་དམ་པར་འགྱུར་བར་ཤོག །
en: “ ‘Through a hundred thousand samādhis, Through countless powers of mental retention, And through the strengths, powers, and branches of enlightenment, May I become a sublime one with the ten strengths.

source: དགོངས་པའི་ཐུགས་ཀྱིས་སངས་རྒྱས་རྣམས། །བདག་ལ་རྣམ་པར་གཟིགས་སུ་གསོལ། །
en: “ ‘I pray that the buddhas look upon me And regard me with their minds.

source: ཐུགས་རྗེར་ལྡན་པའི་ཐུགས་ཀྱིས་ནི། །ནོངས་པ་རབ་ཏུ་གཟུང་དུ་གསོལ། །
en: I pray that with their minds of great compassion They apprehend the errors I have made.

source: བདག་གིས་བསྐལ་པ་བརྒྱ་རྣམས་སུ། །སྔོན་ཆད་སྡིག་པ་གང་བགྱིས་པ། །དེ་ཕྱིར་བདག་ནི་མྱ་ངན་སེམས། །ཕོངས་དང་མྱ་ངན་འཇིགས་པས་གཟིར། །
en: “ ‘I am tormented by a sorrowful mind, By wretchedness, misery, and terror Concerning the bad actions I have done In the past, throughout a hundred eons.

source: སྡིག་པའི་ལས་ལ་འཇིགས་པར་བགྱིད། །ཡིད་ནི་རྟག་ཏུ་དམན་པར་གྱུར། །
en: “ ‘I am terrified of my bad actions; My mind is always low.

source: གང་དང་གང་དུ་འགྲོ་བགྱིད་པ། །བདག་ནི་གང་དུའང་དགའ་མ་མཆིས། །
en: Wherever it is that I go, I find no happiness.

source: སངས་རྒྱས་ཐམས་ཅད་ཐུགས་རྗེར་ལྡན། །འགྲོ་བ་ཀུན་གྱི་འཇིགས་སེལ་བས། །
en: “ ‘All the compassionate buddhas Dispel the fear of all beings.

source: ནོངས་པ་རབ་ཏུ་གཟུང་དུ་གསོལ། །འཇིགས་པ་དག་ལས་བདག་ཐར་མཛོད། །
en: I pray that you apprehend my faults And free me from fear.

source: བདག་གི་ཉོན་མོངས་ལས་རྣམས་ཀྱི། །དྲི་མ་དེ་བཞིན་གཤེགས་པས་སོལ། །
en: “ ‘May the tathāgatas remove The stain of my kleśas and karma.

source: སངས་རྒྱས་རྣམས་ཀྱིས་བདག་ལ་ནི། །ཐུགས་རྗེ་ཆུ་ཡིས་བཀྲུ་བར་གསོལ། །
en: I pray that the buddhas wash me With the water of their compassion.

source: སྡིག་པ་ཐམས་ཅད་བཤགས་པར་བགྱི། །སྔོན་ཆད་བདག་གིས་གང་བགྱིས་དང་། །ད་ལྟར་བདག་གིས་སྡིག་པ་གང་། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘I confess all my bad actions; Those that I have done in the past And those that are my present bad actions, I make a confession of them all.

source: ནོངས་པར་བགྱིས་པའི་ལས་རྣམས་ཀུན། །སླན་ཆད་མི་བགྱི་བསྡམ་པར་བགྱི། །
en: “ ‘I make the commitment that I will not do again All the wrong actions that I have done.

source: བདག་གིས་ནོངས་པར་བགྱིས་པ་གང་། །སྡིག་དེ་བཅབ་པར་མི་བགྱིའོ། །
en: I will not conceal those bad actions, Those wrong actions that I have done.

source: ལུས་ཀྱི་ལས་ནི་རྣམ་གསུམ་དང་། །ངག་གི་རྣམ་པ་བཞི་དག་དང་། །ཡིད་ཀྱི་རྣམ་པ་གསུམ་པོ་རྣམས། །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘There are three kinds of physical actions; There are four kinds of verbal actions; There are three kinds of mental actions— I make a confession of them all.

source: ལུས་ཀྱིས་བགྱིས་དང་ངག་གི་ལས། །ཡིད་ཀྱིས་རྣམ་པར་བསམས་པ་དང་། །ལས་རྣམས་བཅུ་པོ་བགྱིས་པ་དག །དེ་དག་ཐམས་ཅད་བདག་འཆགས་སོ། །
en: “ ‘Those actions done physically, those done verbally, And those done mentally— The ten kinds of karma I have created— I make a confession of them all.

source: མི་དགེ་ལས་བཅུ་སྤངས་ནས་སུ། །དགེ་བ་བཅུ་པོ་བསྟེན་བགྱིས་ལ། །
en: “ ‘Having forsaken the ten bad actions, I will practice the ten that are good.

source: ས་བཅུ་ལ་ནི་བདག་གནས་ཤིང་། །སྟོབས་བཅུ་མཆོག་ཏུ་གྱུར་པར་ཤོག །
en: I will dwell upon the ten bhūmis And be endowed with the ten supreme strengths.

source: བདག་གིས་སྡིག་པའི་ལས་གང་དག །མི་འདོད་འབྲས་བུ་ཐོབ་བགྱིད་པ། །
en: “ ‘Whatever bad karma I possess Will bring undesirable results.

source: སངས་རྒྱས་སྤྱན་སྔར་མཆིས་ནས་ནི། །དེ་དག་ཐམས་ཅད་བཤགས་པར་བགྱི། །
en: I make a confession of all of it In the presence of the buddhas.

source: འཛམ་བུའི་གླིང་འདིར་གང་དག་དང་། །འཇིག་རྟེན་ཁམས་ནི་གཞན་དག་ཏུ། །གང་རྣམས་དགེ་བའི་ལས་བགྱིད་པ། །དེ་དག་ཀུན་ལ་ཡི་རང་ངོ་། །
en: “ ‘Whatever good actions have been done, Whether in this Jambudvīpa Or in other world realms, I rejoice in them all.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱིས་ཀྱང་། །བདག་གིས་བསོད་ནམས་གང་བསྒྲུབས་པ། །བདག་ནི་དགེ་བའི་རྩ་བ་དེས། །བྱང་ཆུབ་མཆོག་ལ་རེག་པར་ཤོག །
en: “ ‘Whatever merit I have created Through my body, speech, and mind, Through those meritorious roots May I reach the highest enlightenment.

source: སྲིད་འགྲོ་ཉམ་ངར་བྱིས་པའི་བློ་ཡིས་ནི། །ཤིན་ཏུ་མི་བཟད་སྡིག་པ་གང་བགྱིས་པ། །སྟོབས་བཅུ་མི་མཉམ་སྤྱན་སྔར་མཆིས་ནས་ནི། །སྡིག་པ་དེ་ཀུན་སོ་སོར་བཤགས་པར་བགྱི། །
en: “ ‘Whatever dreadful bad actions have been made By a foolish mind distressed within existences, I confess each one of those bad actions Before the unequaled one with the ten strengths.

source: སྐྱེ་བ་ཉམ་ང་སྲིད་པ་ཉམ་ང་དང་། །འཇིག་རྟེན་ཉམ་ང་གཡོ་སེམས་ཉམ་ང་བར། །ལུས་ཀྱི་སྤྱོད་པ་ཉམ་ང་སྣ་ཚོགས་ཀྱིས། །བདག་གིས་སྡིག་པ་གང་བསགས་དེ་འཆགས་སོ། །བྱིས་པ་བླུན་བྱས་ཉོན་མོངས་ཉམ་ང་དང་། །སྡིག་པའི་གྲོགས་དང་ཕྲད་པ་ཉམ་ང་དང་། །སྲིད་པ་ཉམ་ང་འདོད་ཆགས་ཉམ་ང་དང་། །
en: “ ‘I confess whatever bad karma I have accumulated In dangerous lives, in dangerous existences, In dangerous worlds with a dangerous and unstable mind, Through various kinds of dangerous physical behavior.

source: ཞེ་སྡང་གཏི་མུག་མུན་པའི་ཉམ་ང་དང་། །ངལ་བའི་ཉམ་ང་དུས་ཀྱི་ཉམ་ང་དང་། །བསོད་ནམས་བསྒྲུབ་པ་ཉམ་ང་དག་གིས་ཀྱང་། །རྒྱལ་བ་མི་མཉམ་མངོན་སུམ་མཆིས་ནས་ནི། །སྡིག་པ་དེ་ཀུན་སོ་སོར་བཤགས་པར་བགྱི། །
en: “ ‘In the presence of the unequaled jinas, I confess every single bad action I have done Because of perilous, foolish stupidity and kleśas, Because of perilous association with wicked friends, “ ‘Because of perilous saṃsāra and perilous desire, Because of perilous anger and perilous ignorance, Because of perilous fatigue and perilous times, And because of a perilous lack of producing merit.

source: སངས་རྒྱས་གསེར་མདོག་རི་སྣང་རི་རབ་འདྲ། །ཡོན་ཏན་རྒྱ་མཚོ་འདྲ་ལ་ཕྱག་འཚལ་ལོ། །
en: “ ‘I praise the buddhas, who are like shining golden mountains— Who are like Sumeru, and like oceans of qualities.

source: རྒྱལ་བ་དེ་དག་རྣམས་ལ་སྐྱབས་སུ་མཆི། །རྒྱལ་བ་དེ་དག་ཀུན་ལ་མགོས་ཕྱག་འཚལ། །
en: I go for refuge to those jinas And bow my head to all those jinas.

source: གསེར་མདོག་གསེར་ནི་དྲི་མ་མེད་པའི་གསེར་གྱི་འོད། །དྲི་མེད་རྣམ་དག་བཻ་ཌཱུརྱ་ཡི་ཡན་ལག་སྤྱན། །སངས་རྒྱས་ཉི་མ་དཔལ་གཟི་གྲགས་འབར་འབྱུང་བའི་གནས། །ཐུགས་རྗེའི་འོད་ཟེར་དག་གིས་མུན་པ་མུན་ནག་བསལ། །
en: “ ‘Golden in color, stainless gold, golden light, With the feature of eyes of pure, stainless beryl— A buddha sun, the source of glorious brilliance and blazing fame Dispels deep darkness with the light rays of compassion.

source: ཡན་ལག་རབ་ཏུ་དྲི་མེད་རབ་བཟང་རྣམ་པར་མཛེས། །སངས་རྒྱས་ཉི་མ་ཡན་ལག་དྲི་མེད་གསེར་འདྲས་ཁྱབ། །
en: “ ‘With perfectly stainless, very beautiful, excellent limbs, The buddha sun’s limbs are as if covered with stainless gold.

source: ཉོན་མོངས་མེས་གདུངས་ཡིད་ཅན་འབར་བའི་མེ་འདྲ་ལ། །ཐུབ་པ་ཟླ་བའི་འོད་ཟེར་དྲ་བས་ཚིམ་པར་མཛད། །
en: The light rays of the muni moon bring pleasure To minds pained by the fires of the kleśas, which are like blazing fires.

source: མཚན་མཆོག་སུམ་ཅུ་གཉིས་ཀྱིས་དབང་པོ་ཡན་ལག་མཛེས། །དཔེ་བྱད་བཟང་པོ་དག་གིས་ཡན་ལག་རྣམ་པར་མཛེས། །དཔལ་གཟི་བསོད་ནམས་འབར་འཁྲུངས་འོད་ཟེར་དྲ་བ་ཡིས། །འཇིག་རྟེན་གསུམ་ན་མུན་ཁྲོད་ཉི་མ་བཞིན་དུ་བཞུགས། །
en: “ ‘With faculties and limbs beautified by the thirty-two supreme signs, Limbs beautified by the excellent features, And with a net of light rays producing blazing, glorious, brilliant merit, You are present like the sun in the darkness of the three worlds.

source: དྲི་མེད་རྒྱ་ཆེན་ཁ་དོག་སྣ་ཚོགས་བཻ་ཌཱུརྱ། །སྐྱ་རེངས་དམར་དང་དངུལ་དང་ཤེལ་བཞིན་ཡན་ལག་དམར། །འོད་ཟེར་དྲ་བ་རྣམ་པ་སྣ་ཚོགས་ལེགས་བརྒྱན་པ། །ཐུབ་ཆེན་ཁྱོད་ནི་ཉི་མ་བཞིན་དུ་དེ་ཡིས་མཛེས། །
en: “ ‘Body aspects the color of vast, beautiful, stainless beryl; The red of dawn, silver, crystal, and copper-red; Adorned by a net of light rays of various colors, You, great Muni, are beautiful like the sun.

source: མྱ་ངན་འཁྲུགས་པའི་འཆི་ཆུ་རྒ་བའི་དབའ་རླབས་ཅན། །
en: “ ‘The multitude of light rays from the sun of the sugatas dry up The intensely fierce and violent ocean of suffering.

source: འཁོར་བའི་ཀླུང་ཆེན་ཕོངས་པའི་ཆུ་བོར་ལྷུང་བ་ལ། །སྡུག་བསྔལ་རྒྱ་མཚོའི་མཆོག་ཏུ་རྩུབ་ཅིང་ཤུགས་དྲག་པ། །བདེ་གཤེགས་ཉི་མའི་འོད་ཟེར་མང་པོ་རྣམས་ཀྱིས་སྐོམས། །
en: Falling into the river of distress, the great river of saṃsāra, Waters of death and waves of aging churn with misery.

source: ཡན་ལག་གསེར་གྱི་མདོག་ཏུ་རྣམ་པར་སྣང་། །ཡེ་ཤེས་འབྱུང་གནས་འཇིག་རྟེན་གསུམ་ཀུན་མཆོག །
en: “ ‘I praise the buddhas, who have golden bodies, The source of wisdom, supreme within the three worlds.

source: རབ་མཛེས་མཚན་གྱིས་ཡན་ལག་རྣམས་སྤྲས་པ། །སངས་རྒྱས་གསེར་སྐུ་འབར་ལ་ཕྱག་འཚལ་ལོ། །
en: Their limbs shine with the color of gold; Their limbs are adorned by beautiful signs.

source: ཇི་ལྟར་རྒྱ་མཚོའི་ཆུ་ནི་དཔག་མེད་དང་། །ཇི་ལྟར་ས་ལ་ས་རྡུལ་མཐའ་ཡས་དང་། །ཇི་ལྟར་རི་རབ་རྡོ་མཐའ་མཚུངས་མེད་དང་། །ཇི་ལྟར་ནམ་མཁའི་མཐའ་མ་མཐའ་ཡས་པ། །དེ་བཞིན་སངས་རྒྱས་ཡོན་ཏན་མཐའ་ཡས་ཏེ། །
en: “ ‘Just as the water of the ocean is immeasurable, Just as the particles in the earth are infinite, Just as there is no end of stones in Meru, And just as there is an endless extent to space, “ ‘The qualities of a buddha are similarly infinite.

source: སེམས་ཅན་ཀུན་གྱིས་ཤེས་པར་མི་ནུས་སོ། །
en: There is no one among all beings who can know them.

source: བསྐལ་པ་དུ་མར་གཞལ་ཞིང་བསམས་ཀྱང་ནི། །ཡོན་ཏན་མཐའ་མ་ཤེས་པར་མི་ནུས་སོ། །
en: Even if they examined and contemplated for many eons, They still would not know the end of those qualities.

source: ཆུ་ནི་སྐྲ་ཡི་རྩེ་མོའི་ཚད་ཙམ་དང་། །རྡོར་བཅས་རིར་བཅས་རྒྱ་མཚོར་བཅས་པ་ནི། །བསྐལ་པར་བགྲངས་ན་ཤེས་པར་ནུས་ཀྱང་སྲིད། །སངས་རྒྱས་ཡོན་ཏན་ཤེས་པར་མི་ནུས་སོ། །
en: “ ‘By counting for eons one may know how many measures, Each the size of a drop of water on the tip of a hair, There are in the earth, with its stones, mountains, and oceans, But one could never perceive a limit to the qualities of a buddha.

source: ཡོན་ཏན་ཁ་དོག་སྙན་དང་གྲགས་པ་དང་། །དགེ་བའི་མཚན་གྱིས་བརྒྱན་པའི་སྐུ་ལུས་དང་། །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་བརྒྱན་པ་ཡིས། །སེམས་ཅན་ཐམས་ཅད་དེ་འདྲར་གྱུར་པར་ཤོག །
en: “ ‘May all beings become like that, With those qualities, colors, fame, and renown, With bodies adorned by the signs of goodness And beautified by the eighty features.

source: བདག་ནི་དགེ་བའི་ལས་རྣམས་འདི་དག་གིས། །འཇིག་རྟེན་མི་རིང་སངས་རྒྱས་འགྱུར་བར་ཤོག །
en: “ ‘May I, through this good karma, Become before long a buddha in the world.

source: འགྲོ་ལ་ཕན་ཕྱིར་ཆོས་ཀྱང་སྟོན་གྱུར་ཅིག །སེམས་ཅན་སྡུག་བསྔལ་མང་གཟིར་ཐར་བྱེད་ཤོག །
en: May I teach the Dharma for the benefit of beings, And may I free beings afflicted by many sufferings.

source: སྟོབས་བཅས་སྡེར་བཅས་བདུད་ལས་རྒྱལ་གྱུར་ཅིག །
en: “ ‘May I be victorious over powerful Māra and his army.

source: ཆོས་ཀྱི་འཁོར་ལོ་དགེ་བ་བསྐོར་བར་ཤོག །
en: May I turn the good wheel of the Dharma.

source: བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ་གནས་གྱུར་ཅིག །བདུད་རྩི་ཆུ་ཡིས་སེམས་ཅན་ཚིམ་བྱེད་ཤོག །
en: May I remain for countless eons, And may I satisfy beings with the water of amṛta.

source: ཇི་ལྟར་སྔོན་གྱི་རྒྱལ་བ་རྫོགས་པ་ལྟར། །ཕ་རོལ་ཕྱིན་དྲུག་བླ་མེད་རྫོགས་པར་ཤོག །
en: “ ‘May I bring to completion the supreme six perfections, Just as the jinas of the past have completed them.

source: ཉོན་མོངས་བཅོམ་ཞིང་སྡུག་བསྔལ་སེལ་གྱུར་ཅིག །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་ཞི་བྱེད་ཤོག །
en: May I destroy the kleśas, clear away suffering, And bring desire, anger, and ignorance to an end.

source: ཚེ་རབས་བརྒྱ་དང་ཚེ་རབས་བྱེ་བ་སྟོང་། །བདག་ནི་རྟག་ཏུ་ཚེ་རབས་དྲན་པར་ཤོག །
en: “ ‘May I always remember lifetimes— A hundred lifetimes, ten billion lifetimes.

source: ཐུབ་པའི་དབང་པོ་རྟག་ཏུ་དྲན་གྱུར་ཅིག །དེ་དག་རྣམས་ཀྱི་གསུང་རྒྱ་ཆེ་ཐོས་ཤོག །
en: May I constantly recollect the lords of munis, And may I listen to their vast speech.

source: བདག་གི་དགེ་བའི་ལས་རྣམས་འདི་དག་གིས། །རྟག་ཏུ་སངས་རྒྱས་འགྲོགས་པ་རྙེད་པར་ཤོག །
en: “ ‘May I through these good actions Always succeed in meeting with buddhas.

source: སྡིག་པའི་ལས་རྣམས་རྣམ་པར་སྤོང་གྱུར་ཅིག །དགེ་བའི་འབྱུང་གནས་དགེ་རྣམས་སྤྱོད་པར་ཤོག །
en: May I completely forsake bad actions And may I practice good actions, the source of merit.

source: ཞིང་རྣམས་ཀུན་ན་སྲོག་ཆགས་ཐམས་ཅད་ཀྱང་། །འཇིག་རྟེན་དག་ན་སྡུག་བསྔལ་ཀུན་ཞི་གྱུར། །
en: “ ‘May all the bad karma of all beings In every realm come to an end in their worlds.

source: སེམས་ཅན་དབང་པོ་མ་ཚང་ཡན་ལག་ཉམས། །དེ་ཀུན་དེ་རིང་དབང་པོ་ཚང་བར་ཤོག །
en: May those beings with impaired faculties and defective limbs All possess complete faculties on this day.

source: གང་དག་ནད་བཏབ་ཉམ་ཆུང་ལུས་ཉམས་དང་། །ཕྱོགས་བཅུ་དག་ན་སྐྱབས་མེད་གྱུར་པ་རྣམས། །དེ་ཀུན་མྱུར་དུ་ནད་ལས་ཐར་གྱུར་ཅིག །ནད་མེད་སྟོབས་དང་དབང་པོ་རྙེད་པར་ཤོག །
en: “ ‘May those in the ten directions who have no protector, And are sick, weak, and feeble in body, All be quickly freed from illness And gain health, strength, and their faculties.

source: གང་དག་རྒྱལ་པོ་ཆོམ་རྐུན་དགྲས་བསྡིགས་བསད་ཐུག་དང་། །སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་བརྒྱ་ཡིས་ཕོངས་གྱུར་པ། །སེམས་ཅན་ཉམ་ཐག་གྱུར་ཅིང་སྡུག་བསྔལ་དེ་དག་ཀུན། །འཇིགས་མཆོག་མི་བཟད་བརྒྱ་པོ་དེ་ལས་ཐར་གྱུར་ཅིག །
en: “ ‘May those whose lives are endangered by attacks from kings and robbers, And are in distress from hundreds of various kinds of suffering— All those beings in misfortune and who are suffering— Become freed from hundreds of the greatest, most dreadful terrors.

source: གང་དག་བརྡེགས་ཤིང་བཅིངས་པས་བཅིངས་གཟིར་བ། །ཕོངས་པ་སྣ་ཚོགས་དག་ན་གནས་གྱུར་ཅིང་། །ཉོན་མོངས་སྟོང་ཕྲག་དུ་མས་དཀྲུགས་ནས་ཀྱང་། །འཇིགས་པ་མི་བཟད་མྱ་ངན་སྣ་ཚོགས་རྙེད། །
en: “ ‘Those who are beaten, who are in painful bondage, Who remain in various kinds of distress, Who are disturbed by thousands of tribulations And meet various kinds of dreadful terrors and miseries, “ ‘May they all become free from their bonds.

source: དེ་དག་ཐམས་ཅད་བཅིངས་ལས་གྲོལ་གྱུར་ཅིག །བརྡེགས་པ་དག་ནི་བརྡེགས་ལས་ཐར་བར་ཤོག །
en: May those who are beaten be freed from beatings.

source: བསད་པ་རྣམས་ཀྱང་སྲོག་དང་ལྡན་གྱུར་ཅིག །ཕོངས་གྱུར་ཐམས་ཅད་འཇིགས་པ་མེད་པར་ཤོག །
en: May those who are to be killed gain their lives, And may they be free from all distress and fear.

source: སེམས་ཅན་གང་དག་བཀྲེས་སྲེད་སྐོམ་གྱིས་གཟིར། །དེ་དག་ཟས་སྐོམ་སྣ་ཚོགས་རྙེད་པར་ཤོག །
en: “ ‘May the beings who are pained by hunger and thirst Obtain various kinds of food and drink.

source: ལོང་བས་གཟུགས་རྣམས་སྣ་ཚོགས་མཐོང་གྱུར་ཅིག །
en: May the blind see the variety of forms.

source: འོན་པས་ཡིད་འོང་སྒྲ་རྣམས་ཐོས་པར་ཤོག །
en: May the deaf hear pleasant sounds.

source: གཅེར་བུ་རྣམས་ཀྱིས་སྣ་ཚོགས་གོས་རྙེད་གྱུར། །
en: “ ‘May the naked find a variety of clothes.

source: སེམས་ཅན་དབུལ་པོས་གཏེར་རྣམས་རྙེད་པར་ཤོག །
en: May poor beings discover treasures.

source: ནོར་འབྲུ་རིན་ཆེན་སྣ་ཚོགས་མང་པོ་ཡིས། །སེམས་ཅན་ཐམས་ཅད་བདེ་དང་ལྡན་པར་ཤོག །
en: May all beings become happily possessed Of many kinds of wealth, grain, and jewels.

source: གང་ཡང་སྡུག་བསྔལ་ཚོར་བས་གནོད་མ་གྱུར། །
en: “ ‘May no one be afflicted with the experience of suffering.

source: སེམས་ཅན་ཐམས་ཅད་བལྟ་ན་སྡུག་པ་དང་། །གཟུགས་བཟང་མཛེས་ཤིང་ཚུལ་དུ་ཤིས་པར་ཤོག །རྟག་ཏུ་བདེ་བ་དུ་མ་སོགས་གྱུར་ཅིག །
en: May all beings become beautiful, With excellent, attractive, pleasant bodies, And always fully possess many kinds of happiness.

source: ཡིད་ཀྱི་ཟས་སྐོམ་རབ་འབྱོར་བསོད་ནམས་དག །བསམས་མ་ཐག་ཏུ་དེ་དག་གྲུབ་གྱུར་ཅིག །རྫ་རྔ་ཅང་ཏེའུ་པི་བང་སྒྲ་སྙན་དང་། །
en: “ ‘May beings, completely endowed with merit, have food and drink As soon as they think of them.

source: ཆུ་མིག་མཚེའུ་དང་རྫིང་བུ་ལྟེང་ཀ་དག །གསེར་གྱི་པདྨ་ཨུཏྤལ་འདབ་མ་ཅན། །ཟས་སྐོམ་གོས་ནོར་མུ་ཏིག་ནོར་བུ་དབྱིག །རྒྱན་གསེར་རིན་ཆེན་སྣ་ཚོགས་བཻ་ཌཱུརྱ། །དེ་དག་བསམས་མ་ཐག་ཏུ་གྲུབ་གྱུར་ཅིག །
en: May they have melodious vīnas, mṛdaṅga drums, and paṭaha drums; Springs, lakes, ponds, and reservoirs, “ ‘With golden lotuses, and blue and red lotuses; Food and drink, clothes, wealth, pearls, jewels, and other treasures; And jewelry of gold and various other jewels and beryls— May they have them all as soon as they are thought of.

source: འཇིག་རྟེན་གང་ནའང་སྡུག་བསྔལ་སྒྲ་མ་བྱུང་། །
en: “ ‘May the word suffering not exist in any world.

source: སེམས་ཅན་གཅིག་ཀྱང་མི་འཕྲོད་མཐོང་མ་གྱུར། །
en: May not a single inimical being be seen.

source: དེ་དག་ཐམས་ཅད་ཁ་དོག་རྒྱ་ཆེན་དང་། །ཕན་ཚུན་དུ་ནི་འོད་བྱེད་གྱུར་པར་ཤོག །
en: May they all have an illustrious color And may they illuminate each other.

source: མི་ཡི་འཇིག་རྟེན་ཕུན་སུམ་ཚོགས་གང་ཡོད། །དེ་དག་བསམས་པར་སྐྱེ་བར་དེ་དག་གྱུར། །བསམ་པ་ཐམས་ཅད་བསམས་མ་ཐག་ཏུ་ཡང་། །བསོད་ནམས་འབྲས་བུ་ཡོངས་སུ་རྫོགས་པར་ཤོག །
en: “ ‘May that which is perfect in the human world, And arises in the minds of beings, Be complete as the result of their merit As soon as they have wished for it.
